# SlabShapeVertexArray Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeVertexArray Constructor
SlabShapeVertexArray Class See Also
---
Initializes a new instance of the SlabShapeVertexArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SlabShapeVertexArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SlabShapeVertexArray()
```

# See Also
SlabShapeVertexArray Class
Autodesk.Revit.DB Namespace